Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: This command also exits with a non-zero status if the check fails, so you can use it in scripts if you want.
cs: Jestliže kontrola selže, příkaz vrací nenulový návratový kód, a proto ho lze snadno používat ve skriptech.

source: This command gives you a diff, but it may be misleading.
cs: Výstupem tohoto příkazu bude výpis diff, který však může být lehce matoucí.

source: This command is run when you push to this repository over SSH; then, other people can clone via something like
cs: Tento příkaz se spustí, když do tohoto repozitáře odesíláte data přes protokol SSH. Poté mohou ostatní klonovat třeba takto:

source: This command is sort of a Swiss army knife for inspecting Git objects.
cs: Tento příkaz je něco jako švýcarský nůž k prohlížení objektů Git.

source: This command lists the tags in alphabetical order; the order in which they appear has no real importance.
cs: Tento příkaz vypíše značky v abecedním pořadí. Pořadí, v němž se značky vyskytují, není relevantní.

source: This command looks up which server origin is (in this case, it’s `git.ourcompany.com`), fetches any data from it that you don’t yet have, and updates your local database, moving your `origin/master` pointer to its new, more up-to-date position (see Figure 3-24).
cs: Tento příkaz zjistí, který server je `origin` (v našem případě je to `git.ourcompany.com`), vyzvedne z něj všechna data, která ještě nemáte, a aktualizuje vaši lokální databázi. Při tom přemístí ukazatel `origin/master` na novou, aktuálnější pozici (viz obrázek 3-24).

source: This command puts conflict markers in any files it has issues with, much like a conflicted merge or rebase operation.
cs: Tento příkaz vloží poznámku o konfliktu (conflict marker) do všech souborů, u nichž došlo k problémům, stejně jako u operací sloučení nebo přeskládání, při nichž došlo ke konfliktu.

source: This command reads simple instructions from stdin to write specific Git data.
cs: Tento příkaz načítá ze vstupů stdin jednoduché instrukce k zapsáni specifických dat systému Git.

source: This command removes all files that end with `~`.
cs: Tento příkaz odstraní všechny soubory, které končí vlnovkou (`~`).

source: This command removes all files that have the `.log` extension in the `log/` directory.
cs: Tímto příkazem odstraníte všechny soubory s příponou `.log` z adresáře `log/`.

source: This command shows which branch is automatically pushed when you run `git push` on certain branches.
cs: Tento příkaz ukazuje, která větev bude automaticky odeslána, pokud spustíte příkaz `git push` na určitých větvích.

source: This command shows you any commits in your current branch that aren’t in the `master` branch on your `origin` remote.
cs: Tento příkaz zobrazí všechny revize ve vaší aktuální větvi, které nejsou obsaženy ve větvi `master` vzdáleného repozitáře `origin`.

source: This command shows you only the work your current topic branch has introduced since its common ancestor with master.
cs: Tento příkaz zobrazí pouze práci, která byla ve vaší aktuální tematické větvi provedena od chvíle, kdy se oddělila od hlavní větve.

source: This command takes your staging area and uses it for the commit.
cs: Tento příkaz vezme vaši oblast připravených změn a použije ji k vytvoření revize.

source: This command uses GPG to verify the signature.
cs: Tento příkaz využívá k ověření podpisu program GPG.

source: This command will apply the other two commits automatically, and then you’re done.
cs: Tento příkaz automaticky aplikuje zbývající dvě revize. Tím je celý proces dokončen.

source: This command works only if you cloned from a server to which you have write access and if nobody has pushed in the meantime.
cs: Tento příkaz bude funkční, pouze pokud jste klonovali ze serveru, k němuž máte oprávnění pro zápis, a pokud sem od vašeho klonování nikdo neposílal svou práci.

source: This command works with lots of formats — you can specify a specific date (“2008-01-15”) or a relative date such as “2 years 1 day 3 minutes ago”.
cs: Tento příkaz pracuje s velkým množstvím formátů. Můžete zadat konkrétní datum („2008-01-15“) nebo relativní datum, např. „2 years 1 day 3 minutes ago“ (před 2 roky, 1 dnem a 3 minutami).

source: This commit is fine, and now Git has all the information it needs to determine where the issue was introduced.
cs: Tato revize je v pořádku, a Git tak má nyní všechny informace, které potřebuje k určení, kde problém vznikl.

source: This concept is true in Git as it is in Subversion (or any CVCS), and this model works perfectly in Git.
cs: Tento koncept platí jak pro Git, tak pro Subversion (popř. jakýkoli CVCS). I v systému Git funguje bez problémů.

source: This creates a new pointer at the same commit you’re currently on (see Figure 3-4).
cs: Tento příkaz vytvoří nový ukazatel na stejné revizi, na níž se právě nacházíte (viz obrázek 3-4).

source: This creates a new subdirectory named `.git` that contains all of your necessary repository files — a Git repository skeleton.
cs: Příkaz vytvoří nový podadresář s názvem `.git`, který bude obsahovat všechny soubory nezbytné pro repozitář, tzv. kostru repozitáře Git.

source: This denies branch and tag deletion over a push across the board — no user can do it.
cs: Paušálně tím zamezíte možnému smazání větve a značek při odesílání, žádný z uživatelů je nebude moci odstranit.

source: This discussion will include not having to create user accounts for each user, adding public read access to repositories, setting up web UIs, using the Gitosis tool, and more.
cs: Dozvíte se v nich, jak se vyhnout nutnosti vytvářet uživatelské účty pro všechny uživatele, jak k repozitářům přiřadit veřejné oprávnění pro čtení, jak nastavit webová rozhraní nebo k čemu se používá nástroj Gitosis.

source: This does a one-time pull and doesn’t save the URL as a remote reference:
cs: Příkaz provede jednorázové stažení a nebude ukládat URL jako referenci na vzdálený repozitář:

source: This does the equivalent of the `svn copy trunk branches/opera` command in Subversion and operates on the Subversion server.
cs: Příkaz je ekvivalentní s příkazem `svn copy trunk branches/opera` v systému Subversion a pracuje na serveru Subversion.

source: This doesn’t affect the commit data in any way — the SSH user you connect as doesn’t affect the commits you’ve recorded.
cs: Tento postup nemá žádný vliv na data vašich revizí – SSH uživatel, jehož účtem se přihlašujete, neovlivní revize, které jste nahráli.

source: This effectively makes nice text-based versions of your Word files before attempting to diff them.
cs: Než se Git pokusí zjistit ve wordovských souborech rozdíly, dojde k jejich převedení na hezké textové verze.

source: This entire chapter basically deals with the stuff in this directory.
cs: Celá tato kapitola se bude zabývat v podstatě jen obsahem tohoto adresáře.

source: This example uses the `-L` option to limit the output to lines 12 through 22:
cs: Následující příklad používá parametr `-L`, který omezí výstup na řádky 12 až 22:

source: This file exists for performance reasons, as it is more efficient to have a single file rather than many small ones for references that don't change very often.
cs: Důvodem k existenci tohoto souboru je výkonnost. Pro reference, které se často nemění je mnohem efektivnější udržovat jeden soubor než mnoho malých.

source: This file is written by the `update-server-info` command, which is why you need to enable that as a `post-receive` hook in order for the HTTP transport to work properly:
cs: Tento soubor se zapisuje příkazem `update-server-info`. To je také důvod, proč ho je nutné zapnout jako zásuvný modul `post-receive`, aby přenos dat prostřednictvím protokolu probíhal správně:

source: This first example describes contributing via forking on Git hosts that support easy forking.
cs: První příklad popisuje, jak se přispívá s využitím rozštěpení na hostitelských serverech Git, které podporují snadné štěpení.

source: This functionality is built into Git at the lowest levels and is integral to its philosophy.
cs: Tato funkce je integrována do systému Git na nejnižších úrovních a je nedílnou součástí jeho filozofie.

source: This gives you a local branch that you can work on that starts where `origin/serverfix` is.
cs: Tímto způsobem získáte lokální větev, na níž můžete pracovat a která začíná na pozici `origin/serverfix`.

source: This gives you a lot more power, at the expense of some complexity, because now fallthrough is not the _only_ way for access to be denied, so the *order of the rules now matters*!
cs: To vám dává mnohem více možností, ale za cenu zvýšení složitosti. Popadnutí sítem pravidel už totiž není _jedinou_ možností vedoucí k zamítnutí přístupu. *Záleží na pořadí pravidel!*

source: This goes through and rewrites every commit to have your new address.
cs: Příkaz projde a přepíše všechny revize tak, aby obsahovaly novou adresu.

source: This happens because Git directly compares the snapshots of the last commit of the topic branch you’re on and the snapshot of the last commit on the `master` branch.
cs: Je to z toho důvodu, že Git přímo srovnává snímky poslední revize v tematické větvi, na níž se nacházíte, se snímky poslední revize ve větvi `master`.

source: This helps make the data more useful:
cs: Díky tomu získáte k datům další užitečné informace:

source: This hook can likewise validate the presence of files external to Git control that you may want copied in when the working tree changes.
cs: Zásuvný modul může rovněž ověřit přítomnost souborů nezahrnutých do správy verzí systému Git, které možná budete chtít po změnách v pracovním stromě zkopírovat.

source: This hook generally isn’t useful for normal commits; rather, it’s good for commits where the default message is auto-generated, such as templated commit messages, merge commits, squashed commits, and amended commits.
cs: Tento zásuvný modul většinou není pro normální revize využitelný. Hodí se spíše pro revize, u nichž je výchozí zpráva generována automaticky, např. zprávy k revizím ze šablony, revize sloučením, komprimované revize a doplněné revize.

source: This hook takes a few options: the path to the file that holds the commit message so far, the type of commit, and the commit SHA-1 if this is an amended commit.
cs: Tento zásuvný modul vyžaduje některá nastavení: cestu k souboru, v němž je zpráva k revizi uložena, typ revize, a jedná-li se o doplněnou revizi, také SHA-1 revize.

source: This is a 40-character string composed of hexadecimal characters (0–9 and a–f) and calculated based on the contents of a file or directory structure in Git.
cs: Jedná se o řetězec o 40 hexadecimálních znacích (0–9; a–f) vypočítaný na základě obsahu souboru nebo adresářové struktury systému Git.

source: This is a bit of a shortcut.
cs: Toto je zkrácená verze příkazu.

source: This is a configuration file that stores the mapping between the project’s URL and the local subdirectory you’ve pulled it into:
cs: Jedná se o konfigurační soubor, v němž je uloženo mapování mezi adresou URL projektu a lokálním podadresářem, do nějž jste stáhli repozitář.

source: This is a directory of scripts that Bash will automatically load to provide shell completions.
cs: Jde o adresář skriptů, ze kterého si Bash automaticky načítá podporu pro shellové dokončování.

source: This is a good option if you’re the only Git user on a Subversion team, and your teammates don’t want `.gitignore` files in the project.
cs: Tuto možnost oceníte, jste-li jediným uživatelem systému Git v týmu používajícím Subversion a vaši kolegové nestojí ve svém projektu o soubory `.gitignore`.

source: This is a nice shortcut to recover stashed work easily and work on it in a new branch.
cs: Jedná se o příjemný a jednoduchý způsob, jak obnovit odloženou práci a pokračovat na ní v nové větvi.

source: This is a powerful tool that can help you check hundreds of commits for an introduced bug in minutes.
cs: Tento příkaz představuje výkonný nástroj, který vám pomůže vyhledat zavlečenou chybu mezi stovkami revizí za pár minut.

source: This is a relatively expensive operation and may add a lot of time to each push, depending on the size of the repository or the push.
cs: Jedná se o poměrně náročnou operaci, která může každé odesílání výrazně zpomalit. Závisí přitom na velikosti repozitáře nebo odesílaných dat.

source: This is a safety feature to prevent accidental removal of data that hasn’t yet been recorded in a snapshot and that can’t be recovered from Git.
cs: Jedná se o bezpečnostní funkci, jež má zabránit nechtěnému odstranění dat, která ještě nebyla nahrána do snímku, a nemohou proto být ze systému Git obnovena.

source: This is a special daemon that comes packaged with Git; it listens on a dedicated port (9418) that provides a service similar to the SSH protocol, but with absolutely no authentication.
cs: Je to speciální démon, který je distribuován spolu se systémem Git. Naslouchá na vyhrazeném portu (9418) a poskytuje podobnou službu jako protokol SSH, avšak bez jakékoliv autentizace.

source: This is a subtle but incredibly annoying fact of cross-platform work.
cs: Je to sice malý, ale neuvěřitelně obtěžující průvodní jev spolupráce mezi různými platformami.

source: This is a tad confusing, because now you’ve seen at least three different ways that Git uses the `^` to modify a commit SHA, but that is what it means here.
cs: Je to trochu matoucí, protože jsme před chvílí viděli minimálně tři různé způsoby, jak Git používá znak `^` k modifikaci hodnoty SHA revize. Tady má tento znak jiný význam.

source: This is a variant of a multiple-repository workflow.
cs: Jedná se o variantu pracovního postupu s více repozitáři.

source: This is a very common workflow with sites like GitHub, where it’s easy to fork a project and push your changes into your fork for everyone to see.
cs: Tento pracovní postup je velmi rozšířený na serverech jako je GitHub, kde je snadné rozštěpit projekt a odeslat změny do své odštěpené části, kde jsou pro každého k nahlédnutí.

source: This is also a nice option for quickly grabbing work from someone else’s working repository.
cs: Jedná se také o výbornou možnost, jak rychle získat práci z pracovního repozitáře někoho jiného.

source: This is also a valid mbox e-mail format.
cs: Zároveň je to také platný e-mailový formát mbox.

source: This is also useful if you have multiple packfiles on the server, so you can see which packfile contains the object you need:
cs: To je rovněž užitečné, máte-li na serveru více balíčkových souborů. Zjistíte tak, který z nich obsahuje hledaný objekt:

source: This is always the last option and is generally preceded by double dashes (`--`) to separate the paths from the options.
cs: Cesta je vždy posledním parametrem a většinou jí předcházejí dvě pomlčky (`--`) , jimiž je oddělena od ostatních parametrů.

source: This is an important distinction between Git and nearly all other VCSs.
cs: Toto je důležitý rozdíl mezi systémem Git a téměř všemi ostatními systémy VCS.

source: This is an important distinction — Git receives a copy of nearly all data that the server has.
cs: Souvisí to s jedním podstatným rozdílem: Git získá kopii téměř všech dat na serveru.

source: This is an important point to remember: Git resets your working directory to look like the snapshot of the commit that the branch you check out points to.
cs: Tento důležitý bod si zapamatujte: Git vždy vrátí pracovní adresář do stejného stavu, jak vypadal snímek revize, na niž ukazuje větev, jejíž checkout nyní provádíte.

source: This is an important point with submodules: you record them as the exact commit they’re at.
cs: Toto je důležitá vlastnost submodulů: zaznamenáváte je jako přesné revize, na nichž se nacházejí.

source: This is an important section to absorb, because if you understand what Git is and the fundamentals of how it works, then using Git effectively will probably be much easier for you.
cs: Odpověď na tuto otázku je velmi důležitá, protože pokud pochopíte, co je Git a na jakém principu pracuje, budete ho bezpochyby moci používat mnohem efektivněji.

source: This is basically the `git log` command, but by default it prints out only the SHA-1 values and no other information.
cs: Tento příkaz má v podstatě stejnou funkci jako `git log`, jeho výstupem jsou ale pouze hodnoty SHA-1 bez dalších informací.

source: This is basically the commit checksum stored in a file — no other information is kept.
cs: Prostá značka je v podstatě kontrolní součet revize uložený v souboru, žádné další informace neobsahuje.

source: This is because SSH access to servers is already set up in most places — and if it isn’t, it’s easy to do.
cs: Je to z toho důvodu, že SSH přístup k serverům je na většině míst už nastaven, a pokud ne, není ho těžké nastavit.

source: This is because Windows uses both a carriage-return character and a linefeed character for newlines in its files, whereas Mac and Linux systems use only the linefeed character.
cs: Windows ve svých souborech používá pro nové řádky jak znak pro návrat vozíku (carriage return), tak znak pro posun o řádek (linefeed), zatímco systémy Mac a Linux používají pouze znak posun o řádek.

source: This is called a _refspec_.
cs: Říká se tomu _refspec_.

source: This is called having a detached HEAD — it means the HEAD file points directly to a commit, not to a symbolic reference.
cs: Říká se tomu oddělená hlava (detached head) – znamená to, že soubor HEAD ukazuje přímo na revizi, ne na symbolickou referenci.

source: This is common if you’re coming from CVS or Subversion, where you’ve defined a module or collection of subdirectories, and you want to keep this type of workflow.
cs: K tomu může dojít, pokud přecházíte ze systému CVS nebo Subversion, kde jste definovali modul nebo několik podadresářů, a chcete v tomto typu pracovního postupu pokračovat.

source: This is different than using a Git server — in Git, you can fully test the state on your client system before publishing it, whereas in SVN, you can’t ever be certain that the states immediately before commit and after commit are identical.
cs: V tom se tento postup liší od používání serveru Git. V systému Git můžete kompletně otestovat stav v systému klienta ještě před zveřejněním. V SVN si naproti tomu nemůžete být nikdy jisti, že je stav bezprostředně před revizí a po revizi identický.

source: This is easy, because you have each one in a directory — you can print out the `deleteall` command followed by the contents of each file in the directory.
cs: To bude snadné, protože máte všechny v jednom adresáři. Zadejte příkaz `deleteall` a k němu přidejte obsah každého souboru v adresáři.

source: This is especially important to understand if you’re used to Subversion, because you’ll notice that the two developers didn’t edit the same file.
cs: To je třeba si uvědomit, zejména pokud jste zvyklí na systém Subversion. Oba vývojáři totiž neupravovali stejný soubor.

source: This is especially useful when you’re generating output for machine parsing — because you specify the format explicitly, you know it won’t change with updates to Git:
cs: Tato možnost je užitečná zejména v situaci, kdy vytváříte výpis pro strojovou analýzu. Jelikož specifikujete formát explicitně, máte jistotu, že se s aktualizací systému Git nezmění:

source: This is essentially what Git does when you run the `git add` and `git commit` commands — it stores blobs for the files that have changed, updates the index, writes out trees, and writes commit objects that reference the top-level trees and the commits that came immediately before them.
cs: To je v podstatě také to, co se odehrává, když zadáte příkazy jako `git add` nebo `git commit` – Git uloží bloby souborů, které byly změněny, akutalizuje index, uloží stromy a zapíše objekty revize, které referencí odkazují na stromy nejvyšší úrovně a revize, které jim bezprostředně předcházely.

source: This is fine if the whole thing is source code, because Git is highly optimized to compress that data efficiently.
cs: Je však jedna věc, která vám může způsobovat problém.

source: This is generally good policy; but in the case of the rebase, you may determine that you know what you’re doing and can force-update the remote branch with a `-f` flag to your push command.
cs: Toto jsou většinou užitečná pravidla. V případě přeskládání však můžete oznámit, že víte, co děláte, a příznakem `-f` v kombinaci s příkazem push můžete donutit vzdálenou větev k aktualizaci.

source: This is generally straightforward to do.
cs: S tím obvykle nebývá problém.

source: This is helpful if a branch in your project has diverged or is specialized, but you want to be able to merge changes back in from it, and you want to ignore certain files.
cs: Tuto možnost využijete, pokud se rozdělila nebo specializovala některá z větví vašeho projektu, avšak vy z ní budete chtít začlenit změny zpět a ignorovat přitom určité soubory.

source: This is how Git stores the content initially — as a single file per piece of content, named with the SHA-1 checksum of the content and its header.
cs: Takto Git ukládá nejprve veškerý obsah – jeden soubor pro každý kus obsahu, nazvaný kontrolním součtem SHA-1 obsahu a záhlaví.

source: This is how other people who clone this project know where to get the submodule projects from.
cs: Ostatní uživatelé, kteří budou tento projekt klonovat, díky tomu zjistí, kde najdou projekty submodulů.

source: This is important because every Git commit uses this information, and it’s immutably baked into the commits you pass around:
cs: Je to důležité, protože tuto informaci Git používá pro každý zápis revize a uvedené údaje stanou trvalou složkou záznamů o revizi, které budou putovat po okolí:

source: This is important because it means that all the SHA-1 checksums for your commits change.
cs: To je důležité, protože to znamená, že se změní všechny kontrolní součty SHA-1 vašich revizí.

source: This is important because with more and more developers, you run into more issues with making sure your code applies cleanly or can be easily merged.
cs: To je důležité zejména z toho hlediska, že s rostoucím počtem vývojářů se také zvětšují starosti s tím, aby byl kód aplikován čistě a aby ho bylo možné snadno začlenit.

source: This is important to remember, because the outcome is a project state that didn’t exist on either of your computers when you pushed.
cs: Tuto skutečnost je dobré mít na paměti, neboť výsledkem takového postupu je stav projektu, který ve chvíli vašeho odeslání neexistoval na žádném z počítačů.

source: This is in sharp contrast to the way most VCS tools branch, which involves copying all of the project’s files into a second directory.
cs: Tato metoda se výrazně liší od způsobu, jakým probíhá větvení v ostatních nástrojích VCS, kde je nutné zkopírovat všechny soubory projektu do jiného adresáře.

source: This is interesting, because now your testing branch has moved forward, but your `master` branch still points to the commit you were on when you ran `git checkout` to switch branches.
cs: Výsledek je zajímavý z toho důvodu, že se větev `testing` posunula vpřed, zatímco větev `master` stále ukazuje na revizi, na níž jste se nacházeli v okamžiku, kdy jste spustili příkaz `git checkout` a přepnuli tím větve.

source: This is just the default refspec for `git fetch` for that remote.
cs: Toto je výchozí vzorec refspec pro příkaz `git fetch` pro tento vzdálený server.

source: This is like `blame` and `log` in that it runs offline and is up to date only as of the last time you communicated with the Subversion server.
cs: Stejně jako v případě příkazů `blame` a `log` pracuje i tento příkaz offline a zobrazuje stav v okamžiku, kdy jste naposledy komunikovali se serverem Subversion.
